In [43]:
import pandas as pd

df_train = pd.read_csv('train.csv')
df_test = pd.read_csv('test.csv')

df_train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [44]:
df_train['Title'] = df_train['Name'].str.extract(' ([A-Za-z]+)\.', expand = False)

df_train['Title'].replace(['Lady', 'Countess','Capt', 'Col', 'Don', 'Dr', 'Major', 
                           'Rev', 'Sir', 'Jonkheer', 'Dona'], 'Others', inplace = True)

df_train['Title'].replace('Mlle', 'Miss', inplace = True)
df_train['Title'].replace('Mme', 'Mrs', inplace = True)
df_train['Title'].replace('Ms', 'Miss', inplace = True)

display(df_train[['Title', 'Survived']].groupby(['Title'], as_index=False).mean())

df_train['Title'] = df_train['Title'].map({'Mr': 0, 'Others': 1, 'Master': 2, 'Miss': 3, 'Mrs': 4})

    Title  Survived
0  Master  0.575000
1    Miss  0.702703
2      Mr  0.156673
3     Mrs  0.793651
4  Others  0.347826

In [45]:
display(df_train[['Embarked', 'Survived']].groupby(['Embarked']).mean().sort_values(by='Survived', ascending = False))
df_train['Embarked'] = df_train['Embarked'].map({'C': 0, 'Q': 1, 'S': 2})

          Survived
Embarked
C         0.553571
Q         0.389610
S         0.336957

In [46]:
df_train['Sex'] = df_train['Sex'].map({'male': 0, 'female': 1})

In [47]:
X_train = df_train.drop(['PassengerId', 'Survived', 'Name', 'Ticket', 'Cabin'], axis = 1)
y_train = df_train['Survived']

X_train.head()

   Pclass  Sex   Age  SibSp  Parch     Fare  Embarked  Title
0       3    0  22.0      1      0   7.2500       2.0      0
1       1    1  38.0      1      0  71.2833       0.0      4
2       3    1  26.0      0      0   7.9250       2.0      3
3       1    1  35.0      1      0  53.1000       2.0      4
4       3    0  35.0      0      0   8.0500       2.0      0

In [48]:
display(X_train.isnull().sum())

Pclass        0
Sex           0
Age         177
SibSp         0
Parch         0
Fare          0
Embarked      2
Title         0
dtype: int64

In [49]:
from sklearn.impute import SimpleImputer

imputer_median = SimpleImputer(strategy = 'median')
X_train = pd.DataFrame(imputer_median.fit_transform(X_train))

display(X_train.isnull().sum())

0    0
1    0
2    0
3    0
4    0
5    0
6    0
7    0
dtype: int64

In [50]:
from sklearn.tree import DecisionTreeClassifier

clf = DecisionTreeClassifier(random_state = 42)
clf.fit(X_train, y_train)
clf.score(X_train, y_train)

0.9820426487093153

In [ ]:
from sklearn.model_selection import GridSearchCV

grid_search = GridSearchCV(DecisionTreeClassifier)

In [51]:
df_test['Title'] = df_test['Name'].str.extract(' ([A-Za-z]+)\.', expand = False)

df_test['Title'].replace(['Lady', 'Countess','Capt', 'Col', 'Don', 'Dr', 'Major', 
                           'Rev', 'Sir', 'Jonkheer', 'Dona'], 'Others', inplace = True)

df_test['Title'].replace('Mlle', 'Miss', inplace = True)
df_test['Title'].replace('Mme', 'Mrs', inplace = True)
df_test['Title'].replace('Ms', 'Miss', inplace = True)

df_test['Title'] = df_test['Title'].map({'Mr': 0, 'Others': 1, 'Master': 2, 'Miss': 3, 'Mrs': 4})

In [52]:
df_test['Embarked'] = df_test['Embarked'].map({'C': 0, 'Q': 1, 'S': 2})
df_test['Sex'] = df_test['Sex'].map({'male': 0, 'female': 1})
X_test = df_test.drop(['PassengerId', 'Name', 'Ticket', 'Cabin'], axis = 1)

In [53]:
X_test = pd.DataFrame(imputer_median.fit_transform(X_test))

In [59]:
y_test_pred = clf.predict(X_test)
pd.concat([df_test['PassengerId'], pd.DataFrame(y_test_pred, columns = ['Survived'])], axis = 1).to_csv('result.csv', index = False)